src_Extension/DataProcessors/mcp_ЧатАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>mcp_ЧатАгента</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_Extension/InformationRegisters/mcp_ИсторияДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>mcp_ИсторияДиалогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованныеИнструменты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_Extension/DataProcessors/mcp_ЧатАгента/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Создает новую сессию диалога
//
// Возвращаемое значение:
//  Строка - идентификатор сессии
//
Функция СоздатьСессию() Экспорт
	
	УникальныйID = Новый УникальныйИдентификатор;
	Сессия = СтрЗаменить(Строка(УникальныйID), "-", "");
	
	Возврат Сессия;
	
КонецФункции

// Очищает историю диалога для сессии
//
// Параметры:
//  Сессия - Строка - идентификатор сессии
//
Процедура ОчиститьИсторию(Сессия) Экспорт
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	// Создаём пустой набор записей с отбором - при записи он очистит все записи по отбору
	НаборЗаписей = РегистрыСведений.mcp_ИсторияДиалогов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Сессия.Установить(Сессия);
	
	// Записываем пустой набор - это удалит все записи по отбору
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
